package de.ait.Homework03;

public class d_hm_190924_02 {

    // 1. Объявите переменные с именами city, population и isCapital, исan соответственно.
    // 2. Присвойте им значения: название города, его население и является ли он столицей.
    // 3. Выведите информацию о городе на экран в формате: “Город [city], население: [population], столица: [isCapital]”.пользуя типы данных String, int и boole

    static String city = "Munich";
    static int population = 1450000;
    static boolean isCapital = false;

    public static void main(String[] args) {
        System.out.println("Город: " + city);
        System.out.println("Население: " + population);
        System.out.println("Столица: " + isCapital);
    }
}
